OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18lf2220.h
//----------------------------- CONFIG2H Options -------------------------------

#define _WDT_OFF_2H             0xFE    // WDT disabled (control is placed on the SWDTEN bit).
#define _WDT_ON_2H              0xFF    // WDT enabled.
#define _WDTPS_1_2H             0xE1    // 1:1.
#define _WDTPS_2_2H             0xE3    // 1:2.
#define _WDTPS_4_2H             0xE5    // 1:4.
#define _WDTPS_8_2H             0xE7    // 1:8.
#define _WDTPS_16_2H            0xE9    // 1:16.
#define _WDTPS_32_2H            0xEB    // 1:32.
#define _WDTPS_64_2H            0xED    // 1:64.
#define _WDTPS_128_2H           0xEF    // 1:128.
#define _WDTPS_256_2H           0xF1    // 1:256.
#define _WDTPS_512_2H           0xF3    // 1:512.
#define _1K                     0xF5    // 1:1024.
#define _WDTPS_1K_2H            0xF5    // 1:1024.
#define _2K                     0xF7    // 1:2048.
#define _WDTPS_2K_2H            0xF7    // 1:2048.
#define _4K                     0xF9    // 1:4096.
#define _WDTPS_4K_2H            0xF9    // 1:4096.
#define _8K                     0xFB    // 1:8192.
#define _WDTPS_8K_2H            0xFB    // 1:8192.
#define _16K                    0xFD    // 1:16384.
#define _WDTPS_16K_2H           0xFD    // 1:16384.
#define _32K                    0xFF    // 1:32768.
#define _WDTPS_32K_2H           0xFF    // 1:32768.

//----------------------------- CONFIG3H Options -------------------------------

#define _CCP2MX_OFF             0xFE    // CCP2 input/output is multiplexed with RB3.
#define _CCP2MX_OFF_3H          0xFE    // CCP2 input/output is multiplexed with RB3.
#define _CCP2MX_B3              0xFE    // CCP2 input/output is multiplexed with RB3.
#define _CCP2MX_B3_3H           0xFE    // CCP2 input/output is multiplexed with RB3.
#define _CCP2MX_ON              0xFF    // CCP2 input/output is multiplexed with RC1.
#define _CCP2MX_ON_3H           0xFF    // CCP2 input/output is multiplexed with RC1.
#define _CCP2MX_C1              0xFF    // CCP2 input/output is multiplexed with RC1.
#define _CCP2MX_C1_3H           0xFF    // CCP2 input/output is multiplexed with RC1.
#define _PBAD_DIG_3H            0xFD    // PORTB<4:0> pins are configured as digital I/O on Reset.
#define _PBAD_ANA_3H            0xFF    // PORTB<4:0> pins are configured as analog input channels on Reset.
#define _MCLRE_OFF_3H           0x7F    // MCLR disabled; RE3 input is enabled in 40-pin devices only (PIC18F4X20).
#define _MCLRE_ON_3H            0xFF    // MCLR pin enabled; RE3 input pin disabled.

//----------------------------- CONFIG4L Options -------------------------------

#define _STVR_OFF_4L            0xFE    // Stack full/underflow will not cause Reset.
#define _STVR_ON_4L             0xFF    // Stack full/underflow will cause Reset.
#define _LVP_OFF_4L             0xFB    // Single-Supply ICSP disabled.
#define _LVP_ON_4L              0xFF    // Single-Supply ICSP enabled.
#define _DEBUG_ON_4L            0x7F    // Background debugger enabled, RB6 and RB7 are dedicated to In-Circuit Debug.
#define _DEBUG_OFF_4L           0xFF    // Background debugger disabled, RB6 and RB7 configured as general purpose I/O pins.

//----------------------------- CONFIG5L Options -------------------------------

#define _CP0_ON_5L              0xFE    // Block 0 (000200-0007FFh) code-protected.
#define _CP0_OFF_5L             0xFF    // Block 0 (000200-0007FFh) not code-protected.
#define _CP1_ON_5L              0xFD    // Block 1 (000800-000FFFh) code-protected.
#define _CP1_OFF_5L             0xFF    // Block 1 (000800-000FFFh) not code-protected.

//----------------------------- CONFIG5H Options -------------------------------

#define _CPB_ON_5H              0xBF    // Boot block (000000-0001FFh) is code-protected.
#define _CPB_OFF_5H             0xFF    // Boot block (000000-0001FFh) is not code-protected.
#define _CPD_ON_5H              0x7F    // Data EEPROM is code-protected.
#define _CPD_OFF_5H             0xFF    // Data EEPROM is not code-protected.

//----------------------------- CONFIG6L Options -------------------------------

#define _WRT0_ON_6L             0xFE    // Block 0 (000200-0007FFh) write-protected.
#define _WRT0_OFF_6L            0xFF    // Block 0 (000200-0007FFh) not write-protected.
#define _WRT1_ON_6L             0xFD    // Block 1 (000800-000FFFh) write-protected.
#define _WRT1_OFF_6L            0xFF    // Block 1 (000800-000FFFh) not write-protected.

//----------------------------- CONFIG6H Options -------------------------------

#define _WRTC_ON_6H             0xDF    // Configuration registers (300000-3000FFh) are write-protected.
#define _WRTC_OFF_6H            0xFF    // Configuration registers (300000-3000FFh) are not write-protected.
#define _WRTB_ON_6H             0xBF    // Boot block (000000-0001FFh) is write-protected.
#define _WRTB_OFF_6H            0xFF    // Boot block (000000-0001FFh) is not write-protected.
#define _WRTD_ON_6H             0x7F    // Data EEPROM is write-protected.
#define _WRTD_OFF_6H            0xFF    // Data EEPROM is not write-protected.

//----------------------------- CONFIG7L Options -------------------------------

#define _EBTR0_ON_7L            0xFE    // Block 0 (000200-0007FFh) protected from table reads executed in other blocks.
#define _EBTR0_OFF_7L           0xFF    // Block 0 (000200-0007FFh) not protected from table reads executed in other blocks.
#define _EBTR1_ON_7L            0xFD    // Block 1 (000800-000FFFh) protected from table reads executed in other blocks.
#define _EBTR1_OFF_7L           0xFF    // Block 1 (000800-000FFFh) not protected from table reads executed in other blocks.

//----------------------------- CONFIG7H Options -------------------------------

#define _EBTRB_ON_7H            0xBF    // Boot block (000000-0001FFh) is protected from table reads executed in other blocks.
#define _EBTRB_OFF_7H           0xFF    // Boot block (000000-0001FFh) is not protected from table reads executed in other blocks.

//==============================================================================

#define __DEVID1                0x3FFFFE
#define __DEVID2                0x3FFFFF

#define __IDLOC0                0x200000
#define __IDLOC1                0x200001
#define __IDLOC2                0x200002
#define __IDLOC3                0x200003
#define __IDLOC4                0x200004
#define __IDLOC5                0x200005
#define __IDLOC6                0x200006
#define __IDLOC7                0x200007

#endif // #ifndef __PIC18LF2220_H__
